{"keras_version": "1.2.2", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 66, 220, 3], "trainable": true, "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0015\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "input_dtype": "float32", "output_shape": null, "output_shape_type": "raw", "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "same", "dim_ordering": "tf", "subsample": [2, 2], "nb_col": 5, "name": "convolution2d_1", "W_constraint": null, "activity_regularizer": null, "nb_row": 5, "trainable": true, "activation": "linear", "b_regularizer": null, "nb_filter": 24, "init": "glorot_uniform", "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_1", "strides": [1, 1]}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "same", "dim_ordering": "tf", "subsample": [2, 2], "nb_col": 5, "name": "convolution2d_2", "W_constraint": null, "activity_regularizer": null, "nb_row": 5, "trainable": true, "activation": "linear", "b_regularizer": null, "nb_filter": 36, "init": "glorot_uniform", "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_2", "strides": [1, 1]}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "same", "dim_ordering": "tf", "subsample": [2, 2], "nb_col": 5, "name": "convolution2d_3", "W_constraint": null, "activity_regularizer": null, "nb_row": 5, "trainable": true, "activation": "linear", "b_regularizer": null, "nb_filter": 48, "init": "glorot_uniform", "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_3", "strides": [1, 1]}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "same", "dim_ordering": "tf", "subsample": [1, 1], "nb_col": 3, "name": "convolution2d_4", "W_constraint": null, "activity_regularizer": null, "nb_row": 3, "trainable": true, "activation": "linear", "b_regularizer": null, "nb_filter": 64, "init": "glorot_uniform", "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_4", "strides": [1, 1]}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "same", "dim_ordering": "tf", "subsample": [1, 1], "nb_col": 3, "name": "convolution2d_5", "W_constraint": null, "activity_regularizer": null, "nb_row": 3, "trainable": true, "activation": "linear", "b_regularizer": null, "nb_filter": 64, "init": "glorot_uniform", "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_5", "strides": [1, 1]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "name": "dense_1", "input_dim": 7680, "activation": "linear", "W_constraint": null, "b_constraint": null, "output_dim": 1164, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "name": "dense_2", "input_dim": 1164, "activation": "linear", "W_constraint": null, "b_constraint": null, "output_dim": 100, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "name": "dense_3", "input_dim": 100, "activation": "linear", "W_constraint": null, "b_constraint": null, "output_dim": 50, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "name": "dense_4", "input_dim": 50, "activation": "linear", "W_constraint": null, "b_constraint": null, "output_dim": 10, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "name": "dense_5", "input_dim": 10, "activation": "linear", "W_constraint": null, "b_constraint": null, "output_dim": 1, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "bias": true}}]}