{"config": [{"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0016\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 66, 220, 3], "output_shape_type": "raw", "arguments": {}, "output_shape": null, "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"name": "convolution2d_1", "nb_col": 5, "b_constraint": null, "nb_row": 5, "nb_filter": 24, "dim_ordering": "tf", "bias": true, "activation": "relu", "trainable": true, "b_regularizer": null, "subsample": [2, 2], "border_mode": "same", "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "convolution2d_2", "nb_col": 5, "b_constraint": null, "nb_row": 5, "nb_filter": 36, "dim_ordering": "tf", "bias": true, "activation": "relu", "trainable": true, "b_regularizer": null, "subsample": [2, 2], "border_mode": "same", "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "convolution2d_3", "nb_col": 5, "b_constraint": null, "nb_row": 5, "nb_filter": 48, "dim_ordering": "tf", "bias": true, "activation": "relu", "trainable": true, "b_regularizer": null, "subsample": [2, 2], "border_mode": "same", "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "convolution2d_4", "nb_col": 3, "b_constraint": null, "nb_row": 3, "nb_filter": 64, "dim_ordering": "tf", "bias": true, "activation": "relu", "trainable": true, "b_regularizer": null, "subsample": [1, 1], "border_mode": "same", "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "convolution2d_5", "nb_col": 3, "b_constraint": null, "nb_row": 3, "nb_filter": 64, "dim_ordering": "tf", "bias": true, "activation": "relu", "trainable": true, "b_regularizer": null, "subsample": [1, 1], "border_mode": "same", "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"input_dim": 16128, "name": "dense_1", "b_constraint": null, "bias": true, "activation": "relu", "trainable": true, "b_regularizer": null, "output_dim": 1164, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"input_dim": 1164, "name": "dense_2", "b_constraint": null, "bias": true, "activation": "relu", "trainable": true, "b_regularizer": null, "output_dim": 100, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"input_dim": 100, "name": "dense_3", "b_constraint": null, "bias": true, "activation": "relu", "trainable": true, "b_regularizer": null, "output_dim": 50, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"input_dim": 50, "name": "dense_4", "b_constraint": null, "bias": true, "activation": "relu", "trainable": true, "b_regularizer": null, "output_dim": 10, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"input_dim": 10, "name": "dense_5", "b_constraint": null, "bias": true, "activation": "relu", "trainable": true, "b_regularizer": null, "output_dim": 1, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}