{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"trainable": true, "name": "lambda_1", "output_shape_type": "raw", "batch_input_shape": [null, 66, 220, 3], "arguments": {}, "output_shape": null, "input_dtype": "float32", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0014\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "name": "convolution2d_1", "nb_row": 5, "W_constraint": null, "nb_filter": 24, "bias": true, "subsample": [2, 2], "activity_regularizer": null, "border_mode": "same", "trainable": true, "nb_col": 5, "dim_ordering": "tf", "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "name": "convolution2d_2", "nb_row": 5, "W_constraint": null, "nb_filter": 36, "bias": true, "subsample": [2, 2], "activity_regularizer": null, "border_mode": "same", "trainable": true, "nb_col": 5, "dim_ordering": "tf", "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "name": "convolution2d_3", "nb_row": 5, "W_constraint": null, "nb_filter": 48, "bias": true, "subsample": [2, 2], "activity_regularizer": null, "border_mode": "same", "trainable": true, "nb_col": 5, "dim_ordering": "tf", "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "name": "convolution2d_4", "nb_row": 3, "W_constraint": null, "nb_filter": 64, "bias": true, "subsample": [1, 1], "activity_regularizer": null, "border_mode": "same", "trainable": true, "nb_col": 3, "dim_ordering": "tf", "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "name": "convolution2d_5", "nb_row": 3, "W_constraint": null, "nb_filter": 64, "bias": true, "subsample": [1, 1], "activity_regularizer": null, "border_mode": "same", "trainable": true, "nb_col": 3, "dim_ordering": "tf", "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "name": "dense_1", "W_constraint": null, "b_regularizer": null, "bias": true, "output_dim": 1164, "input_dim": 16128, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"activation": "relu", "name": "dense_2", "W_constraint": null, "b_regularizer": null, "bias": true, "output_dim": 100, "input_dim": 1164, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"activation": "relu", "name": "dense_3", "W_constraint": null, "b_regularizer": null, "bias": true, "output_dim": 50, "input_dim": 100, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"activation": "relu", "name": "dense_4", "W_constraint": null, "b_regularizer": null, "bias": true, "output_dim": 10, "input_dim": 50, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"activation": "relu", "name": "dense_5", "W_constraint": null, "b_regularizer": null, "bias": true, "output_dim": 1, "input_dim": 10, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform"}}], "keras_version": "1.2.1"}